RAN_1D/channelFlow395K_EPS/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          50;
        startFace       1930;
        matchTolerance  0.0001;
        neighbourPatch  outlet;
        transformType   translational;
        separation      (-1 0 0);
    }
    outlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          50;
        startFace       1980;
        matchTolerance  0.0001;
        neighbourPatch  inlet;
        transformType   translational;
        separation      (1 0 0);
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          20;
        startFace       2030;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          20;
        startFace       2050;
    }
    front
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1000;
        startFace       2070;
        matchTolerance  0.0001;
        neighbourPatch  Back;
        transformType   translational;
        separation      (0 0 -0.1);
    }
    Back
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1000;
        startFace       3070;
        matchTolerance  0.0001;
        neighbourPatch  front;
        transformType   translational;
        separation      (0 0 0.1);
    }
)

// ************************************************************************* //
