RAN_1D/channelFlow395K_EPS/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
1000
(
(0.025 0.02 0.05)
(0.075 0.02 0.05)
(0.125 0.02 0.05)
(0.175 0.02 0.05)
(0.225 0.02 0.05)
(0.275 0.02 0.05)
(0.325 0.02 0.05)
(0.375 0.02 0.05)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
20
(
(0.025 0 0.05)
(0.075 0 0.05)
(0.125 0 0.05)
(0.175 0 0.05)
(0.225 0 0.05)
(0.275 0 0.05)
(0.325 0 0.05)
(0.375 0 0.05)
(0.425 0 0.05)
(0.475 0 0.05)
(0.525 0 0.05)
(0.575 0 0.05)
(0.625 0 0.05)
(0.675 0 0.05)
(0.725 0 0.05)
(0.775 0 0.05)
(0.825 0 0.05)
(0.875 0 0.05)
(0.925 0 0.05)
(0.975 0 0.05)
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
20
(
(0.025 2 0.05)
(0.075 2 0.05)
(0.125 2 0.05)
(0.175 2 0.05)
(0.225 2 0.05)
(0.275 2 0.05)
(0.325 2 0.05)
(0.375 2 0.05)
(0.425 2 0.05)
(0.475 2 0.05)
(0.525 2 0.05)
(0.575 2 0.05)
(0.625 2 0.05)
(0.675 2 0.05)
(0.725 2 0.05)
(0.775 2 0.05)
(0.825 2 0.05)
(0.875 2 0.05)
(0.925 2 0.05)
(0.975 2 0.05)
)
;
    }
    front
    {
        type            cyclic;
    }
    Back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
