RAN_1D/channelFlow395K_EPS/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.08e-3; // 1.08e-3 = 1.125*(69.4)^2/5e6 // 11=3.9% 18.1=5%;
boundaryField
{

 inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }

     front
     {
         type            cyclic;
     }
     Back
     {
          type           cyclic;
     }

    top
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    bottom
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
