RAN_1D/channelFlow395K_EPS/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linearUpwindV grad(U);
    div((nuEff*dev2(T(grad(U))))) Gauss linear; 
    div(phi,k)      Gauss upwind;
    div(phi,epsilon) Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
    //laplacian (nu,U) Gauss linear orthogonal;
    //laplacian ((1|A(U)),p) Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
    //interpolate (HbyA) linear;
}

snGradSchemes
{
   //default         orthogonal;//uncorrected;
   default         uncorrected;

}

fluxRequired
{
   default 	   no;
   p		   ;

}
wallDist
{
   method meshWave;
}

// ************************************************************************* //
