RAN_1D/channelFlow395K_EPS/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          sample;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;

setFormat csv;

sets
(
    verticalline
    {
        type            lineUniform;
        axis            y;
        start           (0.5 0 0.05);
        end             (0.2 2 0.05);
	nPoints		1000;
    }
);

fields
(
    U
);


// ************************************************************************* //
